app/Models/KelasModel.php

SELECT *
FROM `kelas`
WHERE `kelas`.`id` = '1'
SELECT *
FROM `kelas`
---
    public function getKelas($id = null){
        if($id != null){

            return $this->find($id);
        }
        return $this->findAll();