app/Models/UserModel.php

    public function getUser($id = null){
        if($id != null){

            return $this->select('user.*, kelas.nama_kelas')->join('kelas', 'kelas.id=user.id_kelas')->find($id);
        }
        return $this->select('user.*, kelas.nama_kelas')->join('kelas', 'kelas.id=user.id_kelas')->findAll();
---
SELECT `user`.*, `kelas`.`nama_kelas`
FROM `user`
JOIN `kelas` ON `kelas`.`id`=`user`.`id_kelas`
WHERE `user`.`id` = '6'
SELECT `user`.*, `kelas`.`nama_kelas`
FROM `user`
JOIN `kelas` ON `kelas`.`id`=`user`.`id_kelas`

    public function updateUser($data, $id){
        return $this->update($id, $data);
---
UPDATE `user` SET `nama` = 'wajoski', `id_kelas` = '2', `npm` = '550', `updated_at` = '2023-10-29 10:21:04'
WHERE `user`.`id` IN ('6')